      * AUTHOR TANAKA
      * DATE-WRITTEN 1996-03
      * CHANGE-LOG
      * 2009-04-01 TANAKA: Category rate table reviewed.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BILLING.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TAX-RATE-CAT1 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT2 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT3 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT4 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT5 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT6 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT7 PIC 9V99 VALUE 0.08.
       01 TAX-RATE-CAT8 PIC 9V99 VALUE 0.08.
       01 INPUT-LINE PIC X(80).
       01 CATEGORY-NO PIC 9.
       01 AMOUNT-YEN PIC 9(9).
       01 SELECTED-RATE PIC 9V99.
       01 TAX-YEN PIC 9(12).
       PROCEDURE DIVISION.
       MAIN.
           PERFORM UNTIL INPUT-LINE = "END"
               ACCEPT INPUT-LINE
               IF INPUT-LINE NOT = "END"
                   UNSTRING INPUT-LINE DELIMITED BY SPACE
                       INTO CATEGORY-NO AMOUNT-YEN
                   END-UNSTRING
                   PERFORM CALC-TAX
                   PERFORM PRINT-INVOICE
               END-IF
           END-PERFORM
           STOP RUN.
       CALC-TAX.
           EVALUATE CATEGORY-NO
               WHEN 1 MOVE TAX-RATE-CAT1 TO SELECTED-RATE
               WHEN 2 MOVE TAX-RATE-CAT2 TO SELECTED-RATE
               WHEN 3 MOVE TAX-RATE-CAT3 TO SELECTED-RATE
               WHEN 4 MOVE TAX-RATE-CAT4 TO SELECTED-RATE
               WHEN 5 MOVE TAX-RATE-CAT5 TO SELECTED-RATE
               WHEN 6 MOVE TAX-RATE-CAT6 TO SELECTED-RATE
               WHEN 7 MOVE TAX-RATE-CAT7 TO SELECTED-RATE
               WHEN 8 MOVE TAX-RATE-CAT8 TO SELECTED-RATE
               WHEN OTHER MOVE ZERO TO SELECTED-RATE
           END-EVALUATE
           COMPUTE TAX-YEN ROUNDED = AMOUNT-YEN * SELECTED-RATE.
       PRINT-INVOICE.
           DISPLAY CATEGORY-NO "," TAX-YEN.
